Spring-proctice/src/SCenter/xml-library/xml-library/.svn/pristine/22/227fa207a6932436e5f18e987ab33f0c48003b8b.svn-base

<wsdl:definitions name="WebServiceProxyService" targetNamespace="http://xml.A.com/v4" xmlns:tns="http://xml.A.com/v4" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns1="http://schemas.xmlsoap.org/soap/http" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:ac="http://xml.A.com/v4" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xsd:schema targetNamespace="http://xml.A.com/v4">
      <xsd:include schemaLocation="http://xml.A.com/staging/v4/userAccessManagement.xsd"/>
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="UamRequestMessage">
    <wsdl:part name="parameters" element="ac:uamEnterpriseRequest"/>
  </wsdl:message>
  <wsdl:message name="UamResponseMessage">
    <wsdl:part name="parameters" element="ac:uamEnterpriseResponse"/>
  </wsdl:message>
  <wsdl:portType name="WebServiceProxyServicePortType">
    <wsdl:operation name="ManageUser">
      <wsdl:input name="uamRequest" message="ac:UamRequestMessage"/>
      <wsdl:output name="uamResponse" message="ac:UamResponseMessage"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="WebServiceProxyServiceSoapBinding" type="ac:WebServiceProxyServicePortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="ManageUser">
      <soap:operation soapAction="http://sgdv4vm1.A.com:8802/services/userManagement/v4"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="WebServiceProxyService">
    <wsdl:port name="WebServiceProxyServicePort" binding="ac:WebServiceProxyServiceSoapBinding">
      <soap:address location="http://sgdv4vm1.A.com:8802/services/userManagement/v4"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
